Repository: eternaltwin/etwin
Catalog: packages/website/src/locales/messages.*.xlf
Languages: es_sp, fr_fr

# app.menu.toggle
source: Menu
es_sp: Menú

# app.menu.games
source: Games
es_sp: Juegos
fr_fr: Jeux

# app.menu.forum
source: Forum
es_sp: Foros

# app.menu.groups
source: Groups
es_sp: Grupos
fr_fr: Groupes

# app.menu.donate
source: Contribute
es_sp: Contribuir
fr_fr: Contribuer

# app.menu.archive
source: Archive
es_sp: Archivo
fr_fr: Archives

# app.npc.dinorpg
source: Mandragore, a hero and adventurer who has travelled the length and breadth of all DinoRPG lands !
es_sp: ¡Mandrágora, héroe y aventurero que recorre los vastos territorios de DinoRPG!
fr_fr: Mandragore, héros et aventurier ayant parcouru la totalité des terres de DinoRPG !

# app.npc.mybrute
source: My Brute never forgives!
es_sp: ¡El Bruto no perdona!
fr_fr: La Brute : une vraie boucherie !

# app.npc.hordes
source: A zombie, much like ones that haunt the glacial nights of MyHordes...
es_sp: Un zombie, de aquellos que habitan las noches espeluznantes de MyHordes...
fr_fr: Un zombie, de ceux qui hantent les nuits glaciales de Hordes...

# app.npc.alphabounce
source: Zonkerians come from all over the universe and will always provide you with their overpriced items !
es_sp: ¡Uno de los personajes de Alphabounce!
fr_fr: Les Zonkériens sont de tous les univers et vous proposeront toujours leurs articles hors de prix !

# app.npc.fever
source: Pousty, the last hero battling infamous Bakelites to save his world !
es_sp: ¡Pousty, el héroe de Fever!
fr_fr: Pousti, ultime héros combattant les infâmes Bakélites pour sauver son monde !

# app.npc.intrusion
source: Agent S is keeping an eye on you... He knows when you last showered... And he is appalled !
es_sp: El Agente S te está vigilando... Sabe cuándo te duchaste por última vez ... ¡Y está consternado!
fr_fr: L'agent S vous surveille... Il sait à quelle heure remonte votre dernière douche... Et il est consterné !

# app.npc.kingdom
source: Be a good King in life, and in death they will sing your name !
es_sp: ¡Tu destino es ser un conquistador!
fr_fr: Soyez un bon Roi de votre vivant et au moment de votre mort, on chantera votre gloire !

# app.npc.majority
source: Baaaaaa...
es_sp: Beeeeee...
fr_fr: Bêêêêêh...

# app.npc.mush
source: Mushhhhhh...
es_sp: ¡Auxilio, un Muuuuush!

# app.npc.quiz
source: "My name is Norray. James Norray".
es_sp: «Mi nombre es Norray. James Norray».
fr_fr: «Twinoid» se prononce «James Norray».

# app.npc.snake
source: Glorp... glorp... glorp... glopErk... Splash !
es_sp: ¡Voraz devorador de frutas!

# shared.pagination.first
source: First
es_sp: Primera
fr_fr: Première page

# shared.pagination.previous
source: Previous
es_sp: Anterior
fr_fr: Page précédente

# shared.pagination.current
source: Page {{page1}} / {{pageCount}}
es_sp: Página {{page1}} / {{pageCount}}

# shared.pagination.next
source: Next
es_sp: Siguiente
fr_fr: Page suivante

# shared.pagination.last
source: Last
es_sp: Última
fr_fr: Dernière page

# register.username.heading
source: Eternal-Twin registration
es_sp: Registrarse en Eternal-Twin
fr_fr: Inscription à Eternal-Twin

# app.loginNav
source: Sign in
es_sp: Iniciar sesión
fr_fr: Se connecter

# footer.description
source: Eternal-Twin is a non-commercial website operate by hobbyists. Its the goal to archive Motion-Twin's games. This means we want to ensure they remain available even if the official website closes.<strong> We are not related to Motion-Twin</strong>.
es_sp: Eternal-Twin es un sitio web no comercial operado por aficionados. Su meta es archivar los juegos de Motion-Twin. Esto significa que queremos asegurar que permanezcan disponibles incluso si el sitio web oficial cierra. <strong>No estamos relacionados con Motion-Twin</strong>.
fr_fr: Eternal-Twin est un site web non-commercial géré par des amateurs. Son but est d'archiver les jeux de Motion Twin, c'est à dire les garder accessibles même en cas de fermeture du site officiel. <strong>Nous ne sommes pas liés à Motion-Twin</strong>.

# register.heading
source: Eternal-Twin registration
es_sp: Registrarse en Eternal-Twin
fr_fr: Inscription à Eternal-Twin

# register.efWarning
source: If you played on Eternalfest, your account was imported automatically and you should <a routerLink="/login" [queryParams]="{method: 'hammerfest'}">sign-in with Hammerfest</a>.
es_sp: Si jugabas en Eternalfest, tu cuenta fue importada automáticamente y deberías <a>iniciar sesión con Hammerfest</a>.
fr_fr: Si vous avez joué sur Eternalfest, votre compte a été importé automatiquement et vous devriez <a>vous connecter avec Hammerfest</a>.

# register.selectMethod
source: Select your preferred authentication method
es_sp: Selecciona tu método de autenticación preferido
fr_fr: Choisissez votre méthode de connexion préférée.

# register.method.username
source: Pick a username
es_sp: Elige un nombre de usuario
fr_fr: Choisir un nom d'utilisateur

# register.method.email
source: Use my email address (Soon)
es_sp: Usar mi dirección de e-mail (pronto)
fr_fr: Utiliser mon adresse email (Bientôt)

# register.loginLink
source: Already have an account? Sign-in
es_sp: ¿Ya tienes una cuenta? Inicia sesión
fr_fr: Avez-vous déjà un compte ? Connectez vous

# label.emailAddress
source: Email address
es_sp: Dirección de e-mail
fr_fr: Adresse email

# register.email.submit
source: Register (Soon)
es_sp: Registrarse (pronto)
fr_fr: S'inscrire (Bientôt)

# register.backToMethodSelection
source: Back
es_sp: Atrás
fr_fr: Retour

# register.editableProfileInfo
source: Don't worry: you'll be able to edit all the values below in your profile if you ever want to.
es_sp: No te preocupes: podrás editar todos los valores abajo en tu perfil si alguna vez te apetece.
fr_fr: Ne vous inquiétez pas : vous pourrez éditer les valeurs ci-dessous dans votre page de profil si jamais vous souhaitez les changer.

# label.username
source: Username
es_sp: Nombre de usuario
fr_fr: Nom d'utilisateur

# register.usernameInfo
source: The identifier you want to use to sign-in. It must be a unique name containing only "a-z", "0-9" or "_".
es_sp: El identificador que quieres usar para iniciar sesión. Debe ser un nombre único que contenga solamente "a-z", "0-9" o "_".
fr_fr: L'identifiant à utiliser pour vous connecter. Il doit être unique et ne contenir que "a-z", "0-9" ou "_".

# register.usernameRequired
source: The username is required.
es_sp: Se requiere un nombre de usuario.
fr_fr: Le nom d'utilisateur est requis.

# register.usernameMinLength
source: The username must be at least {{$RawUsername.minLength}} characters long.
es_sp: El nombre de usuario debe ser de al menos {{$RawUsername.minLength}} caracteres de largo.
fr_fr: Le nom d'utilisateur doit avoir au moins {{$RawUsername.minLength}} caractères.

# register.usernameMaxLength
source: The username must be at most {{$RawUsername.maxLength}} characters long.
es_sp: El nombre de usuario debe ser, como máximo, de {{$RawUsername.maxLength}} caracteres de largo.
fr_fr: Le nom d'utilisateur doit avoir au plus {{$RawUsername.maxLength}} caractères.

# register.usernamePattern
source: The username can only use the lowercase english letters "a-z" and digits "0-9" (it must start with a letter).
es_sp: El nombre de usuario solo puede contener letras inglesas "a-z" (sin ñ o tildes) y dígitos "0-9" (debe empezar con una letra).
fr_fr: Le nom d'utilisateur ne peut que contenir les lettres minuscules "a-z", les chiffres "0-9" ou "_" (il doit commencer par une lettre).

source: Display name
es_sp: Nombre mostrado
fr_fr: Nom affiché

# register.displayNameInfo
source: How your name should be displayed to other players. You can use any letter, spaces and parenthesis.
es_sp: Cómo se debe mostrar tu nombre ante otros jugadores. Puede usar cualquier letra, espacios y paréntesis.
fr_fr: Comment votre nom devrait être affiché aux autres joueurs. Vous pouvez utilisez toutes les lettres, des espaces et des parenthèses.

# register.displayNameMinLength
source: The display name must be at least {{$UserDisplayName.minLength}} characters long.
es_sp: El nombre mostrado debe ser de al menos {{$UserDisplayName.minLength}} caracteres de largo.
fr_fr: Le nom affiché doit avoir au moins {{$UserDisplayName.minLength}} caractères.

# register.displayNameMaxLength
source: The display name must be at most {{$UserDisplayName.maxLength}} characters long.
es_sp: El nombre mostrado debe ser, como máximo, de{{$UserDisplayName.maxLength}} caracteres de largo.
fr_fr: Le nom affiché doit avoir au plus {{$UserDisplayName.maxLength}} caractères.

# register.displayNamePattern
source: The display name can only use letters, spaces or parenthesis.
es_sp: El nombre mostrado solo puede contener letras, espacios o paréntesis
fr_fr: Le nom affiché ne peut utiliser que des lettres, espaces ou parenthèses.

# label.password
source: Password
es_sp: Contraseña
fr_fr: Mot de passe

# register.passwordRequired
source: The password is required.
es_sp: Se requiere una contraseña.
fr_fr: Le mot de passe est requis

# register.passwordMinLength
source: The password must be at least {{PASSWORD_LEN}} characters long.
es_sp: La contraseña debe ser de al menos {{PASSWORD_LEN}} caracteres de largo.
fr_fr: Le mot de passe doit faire au moins {{PASSWORD_LEN}} caractères.

# label.passwordConfirmation
source: Password confirmation
es_sp: Confirmación de contraseña
fr_fr: Confirmation du mot de passe

# register.passwordConfirmationRequired
source: The password confirmation is required.
es_sp: Se requiere la confirmación de contraseña.
fr_fr: La confirmation du mot de passe est requise.

# register.passwordConfirmationMatch
source: The password confirmation does not match the password.
es_sp: La confirmación de contraseña no coincide con la contraseña.
fr_fr: La confirmation du mot de passe ne correspond pas au mot de passe.

# register.username.submit
source: Register
es_sp: Registrarse
fr_fr: S'inscrire

# register.username.unknownError
source: Registration error: the username is invalid or already used, please report this error if it persists.
es_sp: Error de registración: el nombre de usuario es inválido o ya está usado, por favor, informa de este error si persiste.
fr_fr: Échec d'inscription : le nom d'utilisateur est invalide ou déjà utilisé, veuillez signaler cette erreur si elle persiste.

# register.email.heading
source: Eternal-Twin registration
es_sp: Registrarse en Eternal-Twin

# home.presentation
source: <p> On March 27th 2020, Motion-Twin published <a href="https://twinoid.com/fr/article-fr/6437/twinoid-et-les-jeux-web-de-motion-twin-evoluent">a message</a> on its platform Twinoid about the end of Flash by the end of 2020. Their games will be gradually closed based on how the player-base dwindles. </p><p> Faced with the situation, a few players decided to start a project to save those games: the project Eternal-Twin. Their goal is to keep the corresponding online communities alive and avoid losing this part of video-gaming history. </p><p> This project is lead by Demurgos and TheMoa59, for the technical and organizational side respectively. We also want to thank MrPapy for helping to start the project. Anyone is free to join and help. </p><p> Useful links: </p><ul><li><a href="https://discord.gg/ERc3svy">Eternal-Twin Discord server</a>: Main communication channel</li><li><a href="https://wiki.eternal-twin.net/">Eternal Twinpedia</a>: Wiki for the Motion-Twin games</li><li><a href="https://gitlab.com/eternal-twin">Eternal-Twin Gitlab organization</a>: All our source-code</li></ul>
es_sp: <p> El 27 de marzo de 2020, Motion-Twin publicó <a>un anuncio</a> en su plataforma Twinoid sobre el fin del soporte de Flash a finales de 2020. Sus juegos se cerrarán gradualmente a medida que sus respectivas audiencias se reduzcan. </p><p> Ante esta situación, algunos jugadores han decidido lanzar un proyecto para salvar estos juegos: el proyecto Eternal-Twin. Su objetivo es mantener vivas las comunidades de estos juegos y evitar la desaparición de esta herencia común de los videojuegos. </p><p> Este proyecto está liderado por Demurgos y TheMoa59, en las partes técnicas y organizacional respectivamente. También queremos agradecer a MrPapy por ayudarnos a iniciar el proyecto. Cualquiera es libre de unirse y ayudar. </p><p> Enlaces útiles : </p><ul><li><a>Servidor Discord Eternal-Twin</a>: Principal canal de comunicación</li><li><a>Eternal Twinpedia</a>: Wiki para los juegos de Motion-Twin</li><li><a>Organización Eternal-Twin en Gitlab</a>: Todo nuestro código fuente</li></ul>
fr_fr: <p> Le 27 mars 2020, Motion-Twin a publié sur sa plate-forme Twinoid <a>une annonce</a> relative à l'arrêt du support de Flash d'ici fin 2020. Leurs jeux seront progressivement fermés à mesure que leurs audiences respectives se réduiront. </p><p> Face à ce constat, quelques joueurs ont décidé de lancer un projet pour sauver ces jeux : le projet Eternal-Twin. Leur but est de garder vivantes les communautés de ces jeux et éviter la disparition de cet héritage vidéoludique commun. </p><p> Ce projet est mené par Demurgos et TheMoa59, pour la partie technique et organisationnelle. Nous souhaitons également remercier MrPapy pour avoir aidé à lancer le projet. Chacun peut nous rejoindre et aider. </p><p> Liens utiles : </p><ul><li><a>Serveur Discord Eternal-Twin</a> : Canal de communication principal</li><li><a>Eternal Twinpedia</a> : Wiki pour les jeux Motion-Twin</li><li><a>Organisation Eternal-Twin sur Gitlab</a> : Tout notre code source</li></ul>

# home.generalTitle
source: General informations
es_sp: Información general
fr_fr: Informations générales

# home.generalWhoAreWe
source: Eternal-Twin is a non-commercial website operate by hobbyists. Its the goal to archive Motion-Twin's games. This means we want to ensure they remain available even if the official website closes. <strong>We are not related to Motion-Twin</strong>.
es_sp: Eternal-Twin es un sitio web no comercial operado por aficionados. Su meta es archivar los juegos de Motion-Twin. Esto significa que queremos asegurar que permanezcan disponibles incluso si el sitio web oficial cierra. <strong>No estamos relacionados con Motion-Twin</strong>.
fr_fr: Eternal-Twin est un site web non-commercial géré par des amateurs. Son but est d'archiver les jeux de Motion Twin, c'est à dire les garder accessibles même en cas de fermeture du site officiel. <strong>Nous ne sommes pas liés à Motion-Twin</strong>.

# home.generalNoCheating
source: We reverse engineered some of the games: this is done with the sole purpose of archiving them. We oppose anyone using information we found in order to gain an unfair advantage in any game (even single-player games). We base our judgement on the expectation of the community, not on what is technically possible or not: something may be possible while still being considered cheating.
es_sp: Hemos hecho ingeniería inversa en algunos de los juegos: esto se hace con el único propósito de archivarlos. Nos oponemos a que cualquier persona use información que hayamos encontrado para tener una ventaja injusta en cualquier juego (incluso los juegos de un jugador). Basamos nuestro juicio en lo que espera la comunidad, no en lo que es técnicamente posible o no: algo puede ser posible y que sea considerado hacer trampa.
fr_fr: Nous avons étudié certains jeux par rétro-ingénierie : l'unique but de cette analyse était l'archivage. Nous nous opposons à quiconque utilisant les informations trouvées afin de gagner un avantage en jeu (même pour les jeux à un seul joueur). Nous basons notre jugement sur les attentes de la communauté, pas sur ce qui est techniquement possible : quelque chose peut être possible et pourtant considéré comme de la triche.

# legalLink
source: Legal notices
es_sp: Avisos legales
fr_fr: Mentions légales

# donate.title
source: Contribute to the Eternal-Twin project
es_sp: Aporta tu granito de arena a Eternal-Twin
fr_fr: Contribuer au projet Eternal-Twin

# donate.introduction
source: If you are interested by the project and wish to contribute to it, several choices are offered to you :
es_sp: Si el proyecto te interesa y deseas contribuir, tienes varias opciones :
fr_fr: Si vous êtes intéressé par le projet et souhaitez offrir votre contribution, plusieurs choix s’offrent à vous :

# donate.team.title
source: Enter the team
es_sp: Integra el grupo
fr_fr: Intégrer l'équipe

# donate.team.content
source: <p>The Eternal-Twin team is formed by enthusiasts who wish to see their favorite games persist despite the discontinuation of Flash technology.</p><p>Join our Discord server if you also want to get into the adventure, we are always happy to welcome you !</p>
es_sp: <p>El proyecto Eternal-Twin está conformado por entusiastas que quieren seguir viendo vivos sus juegos favoritos a pesar del cese de la tecnología Flash.</p> <p>¡Únete a nuestro Server de Discord si también quieres ser parte de esta aventura, las puertas siempre estarán abiertas!</p>
fr_fr: <p>L’équipe du projet Eternal-Twin est composée de passionnés qui souhaitent voir leurs jeux favoris persister malgré l’arrêt de la technologie Flash.</p> <p>Rejoignez notre serveur Discord si vous souhaitez également vous investir dans l’aventure, nos portes sont toujours ouvertes !</p>

# donate.team.button
source: Join the Discord
es_sp: Unirse al Servidor
fr_fr: Rejoindre le Discord

# donate.dev.title
source: Support the development
es_sp: Ayuda en el desarrollo
fr_fr: Aider au développement

# donate.dev.content
source: <p>As Eternal-Twin is an ambitious project, all help for developing is welcome.</p><p>If you are interested in browser games and have web develpment skills, feel free to contact our devs and read the documentation !</p>
es_sp: <p>Al ser un proyecto ambicioso, Eternal-Twin agradece cada ayuda que pueda ser dada, por pequeña que sea.</p> <p>Por esto mismo, si estás interesado en los juegos de navegador y quieres mejorar tus capacidades de desarrollo web ¡No dudes en contactar a nuestros Desarrolladores y leer la documentación!</p>
fr_fr: <p>Eternal-Twin étant un projet ambitieux, toute aide au développement est la bienvenue.</p> <p>Si vous êtes intéressé par les browser games et avez des compétences en développement web, n’hésitez pas prendre contact avec nos devs et à lire la documentation !</p>

# donate.dev.button
source: Read the documentation
es_sp: Leer la Documentación
fr_fr: Lire la documentation

# donate.cheer.title
source: Encourage us
es_sp: Anímanos
fr_fr: Nous encourager

# donate.cheer.content
source: <p>Small actions are sometimes the best ! The community is the core element of Eternal-Twin, which is why your feedback, your opinions and your encouragements are so important to us.</p><p>Create an account and take part to the forum's activity !</p>
es_sp: <p>¡Las pequeñas acciones son a veces las mejores! La Comunidad es el eje de Eternal-Twin, por esto mismo tus ánimos, ayuda y retroalimentación son tremendamente importantes para nosotros.</p> <p>¡Así que no esperes, hazte una cuenta y participa en el foro!</p>
fr_fr: <p>Les petites actions sont parfois les meilleures ! La communauté est l’élément central d’Eternal-Twin, c’est pourquoi vos retours, vos avis et vos encouragements nous tiennent particulièrement à cœur.</p> <p>Faites-vous un compte, et allez participer à l’activité du forum !</p>

# donate.cheer.button
source: Visit the forum
es_sp: Visitar los foros
fr_fr: Visiter le forum

# donate.donate.title
source: Fund us
es_sp: Apóyanos financieramente
fr_fr: Nous soutenir financièrement

# donate.donate.content
source: <p>All Eternal-Twin games are entirely free, we depend entirely on your donations for our financial sustainability. We do not seek profit, so the money donated to the project will be used to maintain the required servers and services. Please note that donations are voluntary and do not bring any in-game benefits.</p><p>For the sake of transparency, we have opted to use <a href="https://opencollective.com/eternal-twin">OpenCollective</a> for donations and expenses management. OpenCollective is a reliable platform that lets you know exactly where your money is going.</p><p>Our current objective is 50 € per month. This amount will be split as follows : 20 € for servers, 15 € for email service, 10 € for backups, 5 to 10 € for domain names. The extra funds will be used to either provide better servers or saved for future expenses.</p>
es_sp: <p>Ya que todos los juegos de Eternal-Twin son completamente gratuitos, nuestra supervivencia depende de las donaciones de la comunidad. Nuestra meta no es ganar dinero, así que todas las contribuciones serán utilizadas para mantener los sevidores y demás servicios necesarios. Aclaramos que las donaciones son voluntarias, y no conllevan ningún beneficio en nuestros juegos.</p> <p>La transparencia también es importante para nosotros, así que elegimos <a>OpenCollective</a> para la administración de las donaciones y gastos. OpenCollective es una plataforma confiable que le permite saber a todos en qué se está gastando el dinero recolectado. </p> <p>Nuestro objetivo actual son 50 € (~60 USD) por mes. Esta cantidad se distribuirá de la siguiente manera: 20 € para los servidores, 15 € para el servicio e-mail, 10 € para los back-ups y entre 5 € y 10 € para el pago de dominios. El excedente se utilizará para mejorar la calidad de los servidores, o en su defecto serán almacenados para gastos en el futuro.</p>
fr_fr: <p>Tous les jeux de Eternal-Twin étant entièrement gratuits, notre survie financière dépend entièrement de vos dons. Notre objectif n’est pas le profit, l’argent versé au projet servira donc au maintien des serveurs et des services nécessaires. Notez que les dons sont volontaires et n’entraînent aucun avantage en jeu.</p> <p>Par souci de transparence, nous avons choisi de passer par <a>OpenCollective</a> pour la gestion des donations et dépenses. OpenCollective est une plateforme fiable qui vous permet de savoir exactement où va votre argent.</p> <p>Notre objectif actuel est de 50 € par mois. Ce montant sera réparti de la manière suivante : 20 € pour les serveurs, 15 € pour le service d’emails, 10 € pour nos backups, 5 à 10 € pour les noms de domaine. Les fonds supplémentaires serviront à fournir de meilleurs serveurs ou seront économisés pour de futures dépenses.</p>

# donate.donate.button
source: Donate
es_sp: Hacer una donacion
fr_fr: Faire un don

# archive.dinoparc.error.userNotFound
source: Dinoparc user not found
es_sp: Usuario de Dinoparc no encontrado

# archive.hammerfest.error.userNotFound
source: Hammerfest user not found
es_sp: Usuario de Hammerfest no encontrado

# archive.twinoid.error.userNotFound
source: Twinoid user not found
es_sp: Usuario de Twinoid no encontrado

# app.settingsNav
source: Settings
es_sp: Ajustes
fr_fr: Paramètres

# login.registrationLink
source: Need an account? Register
es_sp: ¿Necesitas una cuenta? Regístrate
fr_fr: Besoin d'un compte ? Inscrivez vous

# login.method.etwin
source: Sign in with Eternal-Twin
es_sp: Iniciar sesión con Eternal-Twin
fr_fr: Se connecter avec Eternal-Twin

# login.passwordRequired
source: The password is required.
es_sp: Se requiere una contraseña.
fr_fr: Le mot de passe est requis.

# login.etwin.submit
source: Sign in
es_sp: Iniciar sesión
fr_fr: Se connecter

# login.etwin.unknownError
source: Failed to authenticate: please check your credentials.
es_sp: La autenticación ha fallado: por favor, comprueba tus credenciales.
fr_fr: Échec de connexion : veuillez vérifier vos identifiants.

# login.method.dinoparc
source: Sign in with Dinoparc
es_sp: Iniciar sesión con Dinoparc

# login.dinoparcServer
source: Server
es_sp: Servidor

# login.dinoparcUsername
source: Dinoparc username
es_sp: Nombre de usuario de Dinoparc

# login.dinoparc.password
source: Dinoparc password
es_sp: Contraseña de Dinoparc

# login.dinoparc.submit
source: Sign in
es_sp: iniciar sesión
