Repository: eternaltwin/etwin
Catalog: packages/website/src/locales/messages.*.xlf
Languages: es_sp, fr_fr

# login.dinoparcUsernameRequired
source: The Dinoparc username is required.
es_sp: Se requiere el nombre de usuario de Dinoparc.

# login.dinoparc.unknownError
source: Failed to authenticate: please check your credentials.
es_sp: Eror de autenticación: Por favor revisa tus credenciales.

# login.hammerfestServer
source: Server
es_sp: Servidor
fr_fr: Serveur

# login.hammerfestUsername
source: Hammerfest username
es_sp: Nombre de usuario de Hammerfest

# login.hammerfest.password
source: Hammerfest password
es_sp: Contraseña de Hammerfest

# login.hammerfestUsernameRequired
source: The username is required.
es_sp: Se requiere un nombre de usuario.
fr_fr: Le nom d'utilisateur est requis

# login.hammerfest.submit
source: Sign in
es_sp: Iniciar sesión
fr_fr: Se connecter

# login.hammerfest.unknownError
source: Failed to authenticate: please check your credentials.
es_sp: La autenticación ha fallado: por favor, comprueba tus credenciales.
fr_fr: Échec de connexion : veuillez vérifier vos identifiants.

# login.twinoid.submit
source: Sign in
es_sp: Iniciar sesión
fr_fr: Se connecter

# app.signOut
source: Sign out
es_sp: Cerrar sesión
fr_fr: Déconnexion

# app.signOut.title
source: Sign out
es_sp: Cerrar sesión
fr_fr: Déconnexion

# app.registerNav
source: Register
es_sp: Registrarse
fr_fr: S'inscrire

# login.method.twinoid
source: Sign in with Twinoid
es_sp: Iniciar sesión con Twinoid
fr_fr: Se connecter avec Twinoid

# login.method.hammerfest
source: Sign in with Hammerfest
es_sp: Iniciar sesión con Hammerfest
fr_fr: Se connecter avec Hammerfest

# login.usernameOrEmail
source: Username or email address
es_sp: Nombre de usuario o dirección de e-mail
fr_fr: Nom d'utilisateur ou adresse email

# login.etwin.password
source: Password
es_sp: Contraseña

# login.usernameOrEmailRequired
source: The username or email is required.
es_sp: Se requiere un nombre de usuario o contraseña.
fr_fr: Le nom d'utilisateur ou l'adresse email est requis.

# legal.title
source: Legal notices
es_sp: Avisos legales
fr_fr: Mentions légales

# legal.hostingTitle
source: Web Hosting Provider
es_sp: Proveedor de alojamiento web
fr_fr: Hébergeur

# legal.hostingIntro
source: Eternal-Twin is hosted by OVH. These are their contact details:
es_sp: Eternal-Twin es alojado por OVH. Estos son sus detalles de contacto:
fr_fr: Eternal-Twin est hébergé auprès d'OVH. Veuillez trouvez ci-dessous leurs données de contact :

# legal.hostingNameLabel
source: Name
es_sp: Nombre
fr_fr: Nom

# legal.hostingAddressLabel
source: Address
es_sp: Dirección
fr_fr: Adresse

# legal.cookiesBody
source: <p>Eternal-Twin avoids any non-necessary cookies.</p><h3>Necessary cookies</h3><p>Eternal-Twin uses cookies to support authentication and remember the user's preferred language. Those are first-party cookies required for the website to work. You may still disable them in your browser settings, but this may prevent the website from working.</p><h3>Other cookies</h3><p>There are no other cookies: no tracking, no analytics, no advertisement.</p>
es_sp: <p>Eternal-Twin evita las cookies que no sean necesarias.</p><h3>Cookies necesarias</h3><p>Eternal-Twin usa cookies para el soporte de autenticación y recordar el idioma preferido del usuario. Estas son cookies de origen (first-party cookies), requeridas para que el sitio web funcione. Puedes deshabilitarlas en la configuración de tu navegador, pero esto puede hacer que el sitio web no funcione.</p><h3>Otras cookies</h3><p>No hay otras cookies: ni de rastreo, ni analíticas, ni publicidad.</p>
fr_fr: <p>Eternal-Twin évite tout n'étant pas nécessaire à la navigation.</p><h3>Cookies nécessaires</h3><p>Eternal-Twin utilise des cookies pour permettre l'authentification et retenir la langue préférée de l'utilisateur. Ces cookies sont nécessaires au fonctionnement du site web. Vous pouvez les désactiver dans les paramètres de votre navigateur, cependant cela peut empêcher le site de fonctionner correctement..</p><h3>Autres cookies</h3><p>Il n'y a pas d'autres cookies : pas de pistage, pas d'analyse, pas de pub.</p>

# legal.personalDataTitle
source: Personal data
es_sp: Datos personales
fr_fr: Données personnelles

# legal.personalDataBody
source: Eternal-Twin stores user emails for authentication (sign-in and password recovery). No other personal data is stored. We do not share, sell or analyze any kind of personal data.
es_sp: Eternalfest almacena emails de usuarios para su autenticación (inicio de sesión y recuperación de contraseña). Ningún otro dato personal se guarda. No compartimos, vendemos ni analizamos ningún tipo de datos personales.
fr_fr: Eternal-Twin stocke l'email de ses utilisateurs pour les besoins de l'authentification (connexion et récupération de mot de passe). Aucune autre donnée personnelle n'est stockée. Nous ne partageons, vendons ou analysons pas de données personnelles.

# games.title
source: Games
es_sp: Juegos
fr_fr: Jeux

# games.eternalfestDescription
source: <a href="https://eternalfest.net/">Eternalfest</a> is a reimplementation of <em>Hammerfest</em>. It has both the official levels, and new content!
es_sp: <a>Eternalfest</a> es una reimplementación de <em>Hammerfest</em>. Tiene los niveles oficiales, ¡y nuevo contenido!
fr_fr: <a>Eternalfest</a> est une recréation de <em>Hammerfest</em>, avec les niveaux officiels ainsi que du nouveau contenu !

# games.eternalfestButton
source: Play now!
es_sp: ¡Juega ahora!
fr_fr: Jouez maintenant !

# games.myhordesDescription
source: <a href="https://zombvival.de/myhordes/">MyHordes</a> is an open implementation of the browser game "Die2Nite" and its other versions by MotionTwin and developed by the community.
es_sp: <a>MyHordes</a> es una implementación abierta del juego de navegador "Zombinoia" y sus otras versiones de MotionTwin, desarrollada por la comunidad.
fr_fr: <a>MyHordes</a> est une implémentation libre développée par la communauté du jeu "Hordes.fr" et de ses autres versions de MotionTwin.

# games.myhordesStatus
source: <em>This game is still in development.</em>
es_sp: <em>Este juego está actualmente en desarrollo.</em>
fr_fr: <em>Ce jeu est actuellement en développement.</em>

# games.myhordesButton
source: Test the alpha !
es_sp: ¡Testea la Beta!
fr_fr: Testez la beta !

# games.directquizStatus
source: <em>This game is available in french only.</em>
es_sp: <em>Este juego solo está disponible en francés.</em>
fr_fr: <em>Ce jeu est disponible uniquement en français.</em>

# games.directquizButton
source: Play now!
es_sp: ¡Juega ahora!
fr_fr: Jouez maintenant !

# games.mjrtStatus
source: <em>This game is available in french only.</em>
es_sp: <em>Este juego solo está disponible en francés.</em>
fr_fr: <em>Ce jeu est disponible uniquement en français.</em>

# games.mjrtButton
source: Play now !
es_sp: ¡Juega ahora!
fr_fr: Jouez maintenant !

# games.dinorpgDescription
source: Train your dinoz and set off on an extraordinary adventure...
es_sp: Un juego de rol lleno de aventuras, personajes y batallas épicas.
fr_fr: Élevez vos dinoz dans un jeu d'aventure extraordinaire !

# games.dinorpgStatus
source: <em>This game is still in development.</em>
es_sp: <em>Este juego está actualmente en desarrollo.</em>
fr_fr: <em>Ce jeu est actuellement en développement.</em>

# games.dinorpgButton
source: Coming soon...
es_sp: Próximamente...
fr_fr: Prochainement...

# games.cafejeuxStatus
source: <em>This game is still in development.</em>
es_sp: <em>Este juego está actualmente en desarrollo.</em>
fr_fr: <em>Ce jeu est actuellement en développement.</em>

# games.cafejeuxButton
source: Coming soon...
es_sp: Próximamente...
fr_fr: Prochainement...

# games.emushDescription
source: Co-operative multiplayer space survival and escape game
es_sp: Tu juego gratuito del espacio con un alien a bordo
fr_fr: Jeu multijoueur de coopération : survie et fuite dans l'espace !

# games.emushStatus
source: <em>This game is still in development.</em>
es_sp: <em>Este juego está actualmente en desarrollo.</em>
fr_fr: <em>Ce jeu est actuellement en développement.</em>

# games.emushButton
source: Test the alpha!
es_sp: ¡Testea la Alpha!
fr_fr: Testez l'alpha !

# games.labruteTitle
source: My Brute
es_sp: El Bruto
fr_fr: La Brute

# games.labruteDescription
source: A free combat game: Create the most brutal fighter ever!
es_sp: ¿Te gusta pelear? ...¡Eres uno de los nuestros!
fr_fr: Jeu de baston gratuit : battez-vous avec votre personnage !

# games.labruteStatus
source: <em>This game is still in development.</em>
es_sp: <em>Este juego está actualmente en desarrollo.</em>
fr_fr: <em>Ce jeu est actuellement en développement.</em>

# games.labruteButton
source: Coming soon...
es_sp: Próximamente...
fr_fr: Prochainement...

# games.moreTitle
source: More to come
es_sp: Más
fr_fr: Plus

# games.moreDescription
source: This section will be expanded as new games are published online.
es_sp: Esta sección será expandida a medida que se publiquen nuevos juegos en línea.
fr_fr: Cette section sera étendue au fur et à mesure que les nouveaux jeux seront publiés.

# forum.addModerator.userLabel
source: New moderator
es_sp: Nuevo moderador
fr_fr: Nouveau modérateur

# forum.addModerator.submit
source: Add moderator
es_sp: Añadir moderador
fr_fr: Ajouter un modérateur

# forum.addModerator.unknownError
source: Moderator addition failure: unknown server error.
es_sp: Fallo de adición de moderador: error desconocido del servidor.
fr_fr: Échec de l'ajout de modérateur : erreur serveur inconnue.

# forum.deleteModerator.submit
source: Delete moderator
es_sp: Suprimir moderador
fr_fr: Supprimer le modérateur

# forum.deleteModerator.unknownError
source: Moderator deletion failure: unknown server error.
es_sp: Fallo de supresión de moderador: error desconocido del servidor.
fr_fr: Échec de la suppression de modérateur : erreur serveur inconnue.

# forum.homeTitle
source: Forum
es_sp: Foros

# forum.newPostLink
source: Reply
es_sp: Responder
fr_fr: Répondre

# forum.newPostLink.guest
source: Sign in to reply
es_sp: Iniciar sesión para responder
fr_fr: Se connecter pour répondre

# forum.error.threadNotFound
source: Forum thread not found
es_sp: Tema del foro no encontrado
fr_fr: Sujet de forum non trouvé

# forum.newThreadLink
source: New thread
es_sp: Nuevo tema
fr_fr: Nouveau sujet

# forum.newThreadLink.guest
source: Sign in to create a new thread
es_sp: Iniciar sesión para crear un nuevo tema
fr_fr: Se connecter pour créer un nouveau sujet

# forum.moderatorsTitle
source: Moderators
es_sp: Moderadores
fr_fr: Modérateurs

# forum.noModerators
source: There are no users with elevated privilege on this forum section. Only administrators can manage this section.
es_sp: No hay usuarios con privilegio elevado en esta sección del foro. Solo los administradores puede manejar esta sección.
fr_fr: Il n'y a pas d'utilisateurs avec droits avancés sur cette section du forum. Seuls les administrateurs peuvent gérer cette section.

# forum.error.sectionNotFound
source: Forum section not found
es_sp: Sección del foro no encontrado
fr_fr: Section de forum non trouvée

# forum.newPost.title
source: Post a reply for <em></em></h1></h1>
es_sp: Enviar una respuesta en <em>{{thread.title}}</em>
fr_fr: Envoyer une réponse dans <em>{{thread.title}}</em>

# forum.newPost.content
source: Body
es_sp: Cuerpo
fr_fr: Corps

# forum.newPost.submit
source: Post the reply
es_sp: Enviar la respuesta
fr_fr: Envoyer la réponse

# forum.newPost.unknownError
source: Post creation failure: unknown server error on reply.
es_sp: Fallo de envío: error desconocido del servidor al responder
fr_fr: Échec de la création du message : erreur serveur inconnue.

# forum.newThread.title
source: New thread in <em></e</h1>
es_sp: Nuevo tema en <em>{{section.displayName}}</em>
fr_fr: Nouveau sujet de discussion dans <em>{{section.displayName}}</em>

# forum.newThread.titleLabel
source: Thread title
es_sp: Título del tema
fr_fr: Titre du sujet de discussion

# forum.newThread.titleRequired
source: The title is required.
es_sp: Se necesita un título.
fr_fr: Le titre est requis.

# forum.newThread.titleMinLength
source: The title must be at least {{$ForumThreadTitle.minLength}} characters long.
es_sp: El título debe tener {{$ForumThreadTitle.minLength}} caracteres como mínimo.
fr_fr: Le titre doit avoir au moins {{$ForumThreadTitle.minLength}} caractères.

# forum.newThread.titleMaxLength
source: The title must be at most {{$ForumThreadTitle.maxLength}} characters long.
es_sp: El título debe tener {{$ForumThreadTitle.maxLength}} caracteres como máximo.
fr_fr: Le titre doit avoir au plus {{$ForumThreadTitle.maxLength}} caractères.

# forum.newThread.content
source: Body
es_sp: Cuerpo
fr_fr: Corps

# forum.newThread.submit
source: Create a new thread
es_sp: Crear nuevo tema
fr_fr: Créer un nouveau sujet de discussion

# forum.newThread.unknownError
source: Thread creation error: unknown server error on creation.
es_sp: Error de creación de tema: error desconocido del servidor al crear.
fr_fr: Échec de la création du sujet de discussion : erreur serveur inconnue.

# forum.post.editLink
source: Edit
es_sp: Editar
fr_fr: Éditer

# forum.post.deleted
source: Deleted post
es_sp: Mensaje suprimido
fr_fr: Message supprimé

# forum.post.title
source: Update post in {{post.thread.title}}, by <etwin-forum-actor [actor]="post.author">, at {{post., at {{post.ctime | date : "short"}}
es_sp: Mensaje actualizado en {{post.thread.title}}, por <etwin-forum-actor></etwin-forum-actor>, {{post.ctime | date : "short"}}
fr_fr: Éditer le message dans {{post.thread.title}}, par <etwin-forum-actor></etwin-forum-actor>, à {{post.ctime | date : "short"}}

# forum.updatePost.hideContent
source: Hide message content
es_sp: Ocultar contenido del mensaje
fr_fr: Masquer le contenu du message

# forum.updatePost.moderation
source: Moderation warning
es_sp: Advertencia de moderación
fr_fr: Avertissement de modération

# forum.updatePost.comment
source: Comment describing the reason of the update
es_sp: Comentario describiendo la razón de la actualización
fr_fr: Commentaire expliquant la raison de la modification

# forum.updatePost.submit
source: Update post
es_sp: Actualizar mensaje
fr_fr: Mettre à jour le message

# forum.updatePost.unknownError
source: Post update failure: unknown server error.
es_sp: Error de actualización de mensaje: Error desconocido del servidor.

# settings.link.hammerfest.username
source: Hammerfest username
es_sp: Nombre de usuario de Hammerfest
fr_fr: Nom d'utilisateur Hammerfest

# settings.link.hammerfest.password
source: Hammerfest password
es_sp: Contraseña de Hammerfest
fr_fr: Mot de passe Hammerfest

# settings.link.hammerfest.submit
source: Link with {{server}}
es_sp: Vincular con {{server}}
fr_fr: Lier avec {{server}}

# settings.link.dinoparc.username
source: Dinoparc username
es_sp: Nombre de usuario de Dinoparc

# settings.link.dinoparc.password
source: Dinoparc password
es_sp: Contraseña de Dinoparc

# settings.link.dinoparc.submit
source: Link with {{server}}
es_sp: Vincular con {{server}}

# settings.link.twinoid.submit
source: Link with Twinoid
es_sp: Vincular con Twinoid
fr_fr: Lier avec Twinoid
